Tekla Open API Reference for Tekla Structures 2025
AnalysisRigidDiaphragm Properties
The AnalysisRigidDiaphragm type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
ExtremaMaximum
 The maximum of the extrema (in the global coordinate system).
ExtremaMinimum
 The minimum of the extrema (in the global coordinate system).
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
MasterNodeID
 The identifier of the master node.
PartIDs
 The part identifier.
SlaveNodeIDs
 The slave node identifier.
Top
See Also
Reference
AnalysisRigidDiaphragm Class
Tekla.Structures.Analysis Namespace